uliano/brio/brio/stm32g0/device_tables.hpp
/// TIMx_BDTR - break inputs, the dead-time generator, MOE and the off
/// states. Exactly the timers with a complementary output (21.4.18,
/// 25.5.16, 25.6.14).
constexpr bool tim_has_break(uint8_t n) { return tim_complementary_channels(n) != 0u; }

/// TIMx_RCR - the repetition counter (an update event every RCR + 1
/// periods). The same four timers again.
constexpr bool tim_has_repetition(uint8_t n) { return tim_has_break(n); }

/// CR1.DIR and CR1.CMS: up/down and centre-aligned counting. DS13560
/// table 7's "counter type" column - only TIM1..TIM4 count anything but
/// up.
constexpr bool tim_has_direction(uint8_t n) {
    switch (n) {
        case 1: case 2: case 3: case 4: return tim_present(n);
        default: return false;
    }
}
constexpr bool tim_has_center_aligned(uint8_t n) { return tim_has_direction(n); }

/// TIMx_TISEL, the input multiplexer that makes a capture channel
/// reachable with no pad at all (an internal clock, a comparator). Every
/// timer with a channel has one; the basic timers have no input.
constexpr bool tim_has_tisel(uint8_t n) { return tim_channels(n) != 0u; }

/// TIMx_DCR/TIMx_DMAR, the DMA burst engine (DS13560 table 7's "DMA
/// request generation"): everything but TIM14.
constexpr bool tim_has_dma_burst(uint8_t n) {
    switch (n) {
        case 1: case 2: case 3: case 4: case 6: case 7: case 15: case 16: case 17:
            return tim_present(n);
        default: return false;
    }
}

/// TIMx_ETR, the external trigger input (SMCR's ECE/ETP/ETPS/ETF half).
/// The timers with a slave controller have it; TIM15 does not (25.5.3
/// gives it ITRx and the TI inputs and no ETR).
constexpr bool tim_has_external_trigger(uint8_t n) {
    switch (n) {
        case 1: case 2: case 3: case 4: return tim_present(n);
        default: return false;
    }
}

/// The NVIC line TIMn's UPDATE, capture/compare, trigger and break
/// events reach. SHARED LINES ARE THE RULE HERE (table 61): TIM3 shares
/// with TIM4 on the G0B1 class, TIM6 with the DAC and LPTIM1, TIM7 with
/// LPTIM2, TIM16 and TIM17 with the two FDCAN interrupt lines - and TIM1
/// alone has TWO vectors, the capture/compare one being separate (see
/// tim_cc_irq). IRQn values are enumerators the preprocessor cannot
/// probe, so this reads the DEVICE SELECT macro, exactly as usart_irq()
/// does; a wrong line here is a silent Default_Handler spin, which is
/// what the family fixture instantiating every present instance on every
/// header is for.
constexpr IRQn_Type tim_irq(uint8_t n) {
#if defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G0B0xx)
    switch (n) {
        case 1: return TIM1_BRK_UP_TRG_COM_IRQn;
        case 2: return TIM2_IRQn;
        case 3: case 4: return TIM3_TIM4_IRQn;
        case 6: return TIM6_DAC_LPTIM1_IRQn;
        case 7: return TIM7_LPTIM2_IRQn;
        case 14: return TIM14_IRQn;
        case 15: return TIM15_IRQn;
        case 16: return TIM16_FDCAN_IT0_IRQn;
        default: return TIM17_FDCAN_IT1_IRQn;
    }
#elif defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G070xx)
    switch (n) {
        case 1: return TIM1_BRK_UP_TRG_COM_IRQn;
        case 2: return TIM2_IRQn;
        case 3: return TIM3_IRQn;
        case 6: return TIM6_DAC_LPTIM1_IRQn;
        case 7: return TIM7_LPTIM2_IRQn;
        case 14: return TIM14_IRQn;
        case 15: return TIM15_IRQn;
        case 16: return TIM16_IRQn;
        default: return TIM17_IRQn;
    }
#else
    // G031/G041/G030/G051/G061/G050: TIM1, TIM2, TIM3, TIM14, TIM16,
    // TIM17, each on a line of its own (LPTIM1/LPTIM2 take positions 17
    // and 18, where the bigger parts put TIM6 and TIM7).
    switch (n) {
        case 1: return TIM1_BRK_UP_TRG_COM_IRQn;
        case 2: return TIM2_IRQn;
        case 3: return TIM3_IRQn;
        case 14: return TIM14_IRQn;
        case 16: return TIM16_IRQn;
        default: return TIM17_IRQn;
    }
#endif
}

/// TIM1's SECOND vector, the capture/compare one (table 61 position 14).
/// Every other timer of this family reports everything on one line, so
/// this equals tim_irq(n) there - which is what lets a handler bind both
/// without asking whether they are two.
constexpr IRQn_Type tim_cc_irq(uint8_t n) {
    return n == 1u ? TIM1_CC_IRQn : tim_irq(n);
}

/// Do TIMn's update/trigger/break and its capture/compare events reach
/// two DIFFERENT vectors? True for TIM1 alone.
constexpr bool tim_has_split_vector(uint8_t n) { return n == 1u && tim_present(n); }

// ---- DMA and DMAMUX (RM0444 ch. 10, 11) --------------------------------------

/// Register block base of DMAn (n = 1, 2), 0 when the device does not
/// have it. Only the G0B1/G0C1 class carries a second controller.
constexpr uint32_t dma_base(uint8_t n) {
    switch (n) {
#if defined(DMA1_BASE)
        case 1: return DMA1_BASE;
#endif
#if defined(DMA2_BASE)
        case 2: return DMA2_BASE;
#endif
        default: return 0u;
    }
}

constexpr bool dma_present(uint8_t n) { return dma_base(n) != 0u; }

/// Register block base of channel `ch` (1-based, as the silicon and the
/// manual number them) of DMAn; 0 when that channel does not exist. The
/// header spells one macro per channel, so each is probed by name - and
/// the probe is what says the G031 class has five channels where the
/// G071 class has seven.
constexpr uint32_t dma_channel_base(uint8_t n, uint8_t ch) {
    if (n == 1u) {
        switch (ch) {
#if defined(DMA1_Channel1_BASE)
            case 1: return DMA1_Channel1_BASE;
#endif
#if defined(DMA1_Channel2_BASE)
            case 2: return DMA1_Channel2_BASE;
#endif
#if defined(DMA1_Channel3_BASE)
            case 3: return DMA1_Channel3_BASE;
#endif
#if defined(DMA1_Channel4_BASE)
            case 4: return DMA1_Channel4_BASE;
#endif
#if defined(DMA1_Channel5_BASE)
            case 5: return DMA1_Channel5_BASE;
#endif
#if defined(DMA1_Channel6_BASE)
            case 6: return DMA1_Channel6_BASE;
#endif
#if defined(DMA1_Channel7_BASE)
            case 7: return DMA1_Channel7_BASE;
#endif
            default: return 0u;
        }
    }
    if (n == 2u) {
        switch (ch) {
#if defined(DMA2_Channel1_BASE)
            case 1: return DMA2_Channel1_BASE;
#endif
#if defined(DMA2_Channel2_BASE)
            case 2: return DMA2_Channel2_BASE;
#endif
#if defined(DMA2_Channel3_BASE)
            case 3: return DMA2_Channel3_BASE;
#endif
#if defined(DMA2_Channel4_BASE)
            case 4: return DMA2_Channel4_BASE;
#endif
#if defined(DMA2_Channel5_BASE)
            case 5: return DMA2_Channel5_BASE;
#endif
            default: return 0u;
        }
    }
    return 0u;
}

